nxp-mcuxpresso/mcux-soc-svd/MCXN537T/MCXN537T_cm33_core1.xml
        <register>
          <name>SSC0</name>
          <description>TSI SSC 0</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x60320000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSC_PRESCALE_NUM</name>
              <description>SSC Prescale Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>div1</name>
                  <description>div = 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div2</name>
                  <description>div = 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div4</name>
                  <description>div = 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div8</name>
                  <description>div = 8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div16</name>
                  <description>div = 16</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div32</name>
                  <description>div = 32</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div64</name>
                  <description>div = 64</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div128</name>
                  <description>div = 128</description>
                  <value>0x7F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div256</name>
                  <description>div = 256</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BASE_NOCHARGE_NUM</name>
              <description>Base Nocharge Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ssc_1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_2</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_3</name>
                  <description>3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_4</name>
                  <description>4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_5</name>
                  <description>5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_6</name>
                  <description>6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_7</name>
                  <description>7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_8</name>
                  <description>8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_9</name>
                  <description>9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_10</name>
                  <description>10</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_11</name>
                  <description>11</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_12</name>
                  <description>12</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_13</name>
                  <description>13</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_14</name>
                  <description>14</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_15</name>
                  <description>15</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_16</name>
                  <description>16</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHARGE_NUM</name>
              <description>Charge Number</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ssc_1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_2</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_3</name>
                  <description>3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_4</name>
                  <description>4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_5</name>
                  <description>5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_6</name>
                  <description>6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_7</name>
                  <description>7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_8</name>
                  <description>8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_9</name>
                  <description>9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_10</name>
                  <description>10</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_11</name>
                  <description>11</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_12</name>
                  <description>12</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_13</name>
                  <description>13</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_14</name>
                  <description>14</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_15</name>
                  <description>15</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ssc_16</name>
                  <description>16</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSC_CONTROL_REVERSE</name>
              <description>SSC Control Reverse</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Polarity retained</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Polarity reversed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSC_MODE</name>
              <description>SSC Mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>prbs</name>
                  <description>PRBS mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn</name>
                  <description>Up-Down Counter mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disables SSC function</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nc</name>
                  <description>Do not use</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRBS_OUTSEL</name>
              <description>PRBS Output Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nc1</name>
                  <description>Do not use</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nc2</name>
                  <description>Do not use</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_2</name>
                  <description>2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_3</name>
                  <description>3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_4</name>
                  <description>4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_5</name>
                  <description>5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_6</name>
                  <description>6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_7</name>
                  <description>7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_8</name>
                  <description>8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_9</name>
                  <description>9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_10</name>
                  <description>10</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_11</name>
                  <description>11</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_12</name>
                  <description>12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_13</name>
                  <description>13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_14</name>
                  <description>14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prbs_15</name>
                  <description>15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSC1</name>
          <description>TSI SSC 1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x600040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRBS_SEED_LO</name>
              <description>PRBS Low Seed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRBS_SEED_HI</name>
              <description>PRBS High Seed</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRBS_WEIGHT_LO</name>
              <description>PRBS Low Weight</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRBS_WEIGHT_HI</name>
              <description>PRBS High Weight</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSC2</name>
          <description>TSI SSC 2</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10080101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MOVE_REPEAT_NUM</name>
              <description>Move Repeat Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>updn_1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn_2</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn_3</name>
                  <description>3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn_4</name>
                  <description>4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn_5</name>
                  <description>5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn_6</name>
                  <description>6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn_7</name>
                  <description>7</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOVE_STEPS_NUM</name>
              <description>Move Steps Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>updn0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn2</name>
                  <description>2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn3</name>
                  <description>3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn4</name>
                  <description>4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn5</name>
                  <description>5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn6</name>
                  <description>6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>updn7</name>
                  <description>7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOVE_NOCHARGE_MAX</name>
              <description>Move Nocharge Maximum</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOVE_NOCHARGE_MIN</name>
              <description>Move Nocharge Minimum</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>mv_1</name>
                  <description>(1 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_2</name>
                  <description>(2 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_3</name>
                  <description>(3 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_4</name>
                  <description>(4 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_5</name>
                  <description>(5 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_6</name>
                  <description>(6 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_7</name>
                  <description>(7 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_8</name>
                  <description>(8 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_9</name>
                  <description>(9 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_10</name>
                  <description>(10 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_11</name>
                  <description>(11 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_12</name>
                  <description>(12 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_13</name>
                  <description>(13 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_14</name>
                  <description>(14 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_15</name>
                  <description>(15 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mv_16</name>
                  <description>(16 + SSC0[BASE_NOCHARGE_NUM])</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
