nxp-mcuxpresso/mcux-soc-svd/MCXN537T/MCXN537T_cm33_core1.xml
        <register>
          <name>PFDA_TOG</name>
          <description>PFD A</description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1010101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToToggle</modifiedWriteValues>
          <fields>
            <field>
              <name>PFD0_CLKGATE</name>
              <description>PFD0 Clock Gate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>PFD0_FRAC</name>
              <description>PFD0 Fractional Divider</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>PFD0_STABLE</name>
              <description>PFD0 Stable Signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USBHS1_PHY_DCD</name>
      <description>USBDCD</description>
      <groupName>USBHSDCD</groupName>
      <baseAddress>0x4010A800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IACK</name>
              <description>Interrupt Acknowledge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_NOCLEAR</name>
                  <description>Do not clear the interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_CLEAR</name>
                  <description>Clear the IF field (interrupt flag).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IF</name>
              <description>Interrupt Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_PEND</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_NOPEND</name>
                  <description>An interrupt is pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE</name>
              <description>Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS_INT</name>
                  <description>Disable interrupts to the system.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_INT</name>
                  <description>Enable interrupts to the system.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BC12</name>
              <description>Battery Charging Revision 1.2 Compatibility</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BC11</name>
                  <description>Compatible with BC1.1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BC12</name>
                  <description>Compatible with BC1.2 (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Start Change Detection Sequence</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_START</name>
                  <description>Do not start the sequence. Writes of this value have no effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Initiate the charger detection sequence. If the sequence is already running, writes of this value have no effect.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SR</name>
              <description>Software Reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RESET</name>
                  <description>Do not perform a software reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_RESET</name>
                  <description>Perform a software reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK</name>
          <description>Clock</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x61</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLOCK_UNIT</name>
              <description>Unit of Measurement Encoding for Clock Speed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KHZ_CLK</name>
                  <description>kHz Speed (between 4 kHz and 1023 kHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MHZ_CLK</name>
                  <description>MHz Speed (between 1 MHz and 1023 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCK_SPEED</name>
              <description>Numerical Value of Clock Speed in Binary</description>
              <bitOffset>2</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_RES</name>
              <description>Charger Detection Sequence Results</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RESULT</name>
                  <description>No results to report.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONN_SDP</name>
                  <description>Attached to an SDP. Must comply with USB 2.0 by drawing only 2.5 mA (max) until connected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONN_CP</name>
                  <description>Attached to a charging port. The exact meaning depends on the STATUS[SEQ_STAT] field (value 0: Attached to either a CDP or a DCP. The charger type detection has not completed. value 1: Attached to a CDP. The charger type detection has completed.)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONN_DCP</name>
                  <description>Attached to a DCP.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQ_STAT</name>
              <description>Charger Detection Sequence Status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DATA_PIN_CONN</name>
                  <description>The module is either not enabled, or the module is enabled but the data pins have not yet been detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_PIN_CONN</name>
                  <description>Data pin contact detection is complete.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CP_DET_DONE</name>
                  <description>Charging port detection is complete.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT_DET_DONE</name>
                  <description>Charger type detection is complete.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERR</name>
              <description>Error Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SEQ_ERR</name>
                  <description>No sequence errors.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_ERR</name>
                  <description>Error in the detection sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TO</name>
              <description>Timeout Flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TIMEOUT</name>
                  <description>The detection sequence is not running for over 1 s.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMEOUT</name>
                  <description>It is over 1 s since the data pin contact was detected and debounced.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTIVE</name>
              <description>Active Status Indicator</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_NOT_RUNNING</name>
                  <description>The sequence is not running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_RUNNING</name>
                  <description>The sequence is running.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGNAL_OVERRIDE</name>
          <description>Signal Override</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS</name>
              <description>Phase Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_OVERRIDE</name>
                  <description>No overrides. Field must remain at this value during normal USB data communication to prevent unexpected conditions on USB_DP and USB_DM pins. (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRI_DET_OVERRIDE</name>
                  <description>Enables VDP_SRC voltage source for the USB_DP pin and IDM_SINK current source for the USB_DM pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDP_ADVERT</name>
                  <description>Enables VDM_SRC voltage source only.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER0</name>
          <description>TIMER0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TUNITCON</name>
              <description>Unit Connection Timer Elapse (in ms)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSEQ_INIT</name>
              <description>Sequence Initiation Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_0</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1018</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x3FA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1019</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x3FB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1020</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x3FC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1021</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x3FD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1022</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x3FE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1023</name>
                  <description>0 ms - 1023 ms</description>
                  <value>0x3FF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
