nxp-mcuxpresso/mcux-soc-svd/MCXN537T/MCXN537T_cm33_core1.xml
        <register>
          <name>AIPS_BRIDGE_GROUP0_MEM_RULE0</name>
          <description>AIPS Bridge Group 0 Memory Rule 0</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO5_ALIAS0</name>
              <description>GPIO5_ALIAS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO5_ALIAS1</name>
              <description>GPIO5_ALIAS2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT5</name>
              <description>PORT5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMU0</name>
              <description>FMU0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCG0</name>
              <description>SCG0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPC0</name>
              <description>SPC0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUU0</name>
              <description>WUU0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRO0</name>
              <description>TRO0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AIPS_BRIDGE_GROUP0_MEM_RULE1</name>
          <description>AIPS Bridge Group 0 Memory Rule 1</description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPTMR0</name>
              <description>LPTMR0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPTMR1</name>
              <description>LPTMR1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTC</name>
              <description>RTC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMU_TEST</name>
              <description>FMU_TEST</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
