nxp-mcuxpresso/mcux-soc-svd/MCXN537T/MCXN537T_cm33_core1.xml
        <register>
          <name>MASTER_SEC_ANTI_POL_REG</name>
          <description>Master Secure Level</description>
          <addressOffset>0xFD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xBFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU1</name>
              <description>CPU1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMARTDMA</name>
              <description>SMARTDMA Data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>eDMA0</name>
              <description>eDMA0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>eDMA1</name>
              <description>eDMA1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKC</name>
              <description>PKC</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PQ</name>
              <description>PowerQuad</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPUO</name>
              <description>NPU Operands</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COOLFLUXI</name>
              <description>Coolflux Instruction</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_FS</name>
              <description>USB_FS</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETHERNET</name>
              <description>Ethernet</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_HS</name>
              <description>USB HS</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USDHC</name>
              <description>uSDHC</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASTER_SEC_LEVEL_ANTIPOL_LOCK</name>
              <description>Master SEC Level Antipol Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>MASTER_SEC_LEVEL_LOCK cannot be written</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>MASTER_SEC_LEVEL_LOCK can be written</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU0_LOCK_REG</name>
          <description>Miscellaneous CPU0 Control Signals</description>
          <addressOffset>0xFEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x800002AA</resetValue>
          <resetMask>0xC00003FF</resetMask>
          <fields>
            <field>
              <name>LOCK_NS_VTOR</name>
              <description>LOCK_NS_VTOR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_NS_VTOR_EQ_1</name>
                  <description>CM33 (CPU0) LOCKNSVTOR is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_NS_VTOR_EQ_0</name>
                  <description>CM33 (CPU0) LOCKNSVTOR is 0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_NS_MPU</name>
              <description>LOCK_NS_MPU</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_NS_MPU_EQ_1</name>
                  <description>CM33 (CPU0) LOCK_NS_MPU is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_NS_MPU_EQ_0</name>
                  <description>CM33 (CPU0) LOCK_NS_MPU is 0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_S_VTAIRCR</name>
              <description>LOCK_S_VTAIRCR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_S_VTAIRCR_EQ_1</name>
                  <description>CM33 (CPU0) LOCK_S_VTAIRCR is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_S_VTAIRCR_EQ_0</name>
                  <description>CM33 (CPU0) LOCK_S_VTAIRCR is 0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_S_MPU</name>
              <description>LOCK_S_MPU</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_S_MPU_EQ_1</name>
                  <description>CM33 (CPU0) LOCK_S_MPU is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_S_MPU_EQ_0</name>
                  <description>CM33 (CPU0) LOCK_S_MPU is 0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_SAU</name>
              <description>LOCK_SAU</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_SAU_EQ_1</name>
                  <description>CM33 (CPU0) LOCK_SAU is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_SAU_EQ_0</name>
                  <description>CM33 (CPU0) LOCK_SAU is 0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM33_LOCK_REG_LOCK</name>
              <description>CM33_LOCK_REG_LOCK</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM33_LOCK_REG_LOCK_EQ_1</name>
                  <description>CM33_LOCK_REG_LOCK is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM33_LOCK_REG_LOCK_EQ_0</name>
                  <description>CM33_LOCK_REG_LOCK is 0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU1_LOCK_REG</name>
          <description>Miscellaneous CPU1 Control Signals</description>
          <addressOffset>0xFF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>LOCK_NS_VTOR</name>
              <description>LOCK_NS_VTOR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_NS_VTOR_EQ_1</name>
                  <description>CM33 (CPU0) LOCKNSVTOR is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_NS_VTOR_EQ_0</name>
                  <description>CM33 (CPU0) LOCKNSVTOR is 0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_NS_MPU</name>
              <description>LOCK_NS_MPU</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_NS_MPU_EQ_1</name>
                  <description>CM33 (CPU0) LOCK_NS_MPU is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_NS_MPU_EQ_0</name>
                  <description>CM33 (CPU0) LOCK_NS_MPU is 0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
